tests/golden/d2/example.d2
direction: down
app1.models: {
  shape: class
  style: {
    fill: "#2ECC71"
  }
}

app2.service: {
  shape: class
  style: {
    fill: "#2ECC71"
  }
}

plugins.auth.backend: {
  shape: class
  style: {
    fill: "#1ABC9C"
  }
}
app2 -> app1
app2 -> plugins
