tests/golden/puml/example.puml
@startuml
!theme amiga

top to bottom direction
hide empty members

class app1.models <<(M, #2ECC71)>>
class app2.service <<(M, #2ECC71)>>
class plugins.auth.backend <<(M, #1ABC9C)>>

app2 ---> app1
app2 ---> plugins
@enduml
